stm32-hotspot/STM32C0316-DK-Brisk-Demo/B_OPTO_INERT/ism330dlc_reg.h
typedef enum {
  ISM330DLC_DRDY_LATCHED    = 0,
  ISM330DLC_DRDY_PULSED     = 1,
} ism330dlc_drdy_pulsed_t;
int32_t ism330dlc_data_ready_mode_set(ism330dlc_ctx_t *ctx,
                                    ism330dlc_drdy_pulsed_t val);
int32_t ism330dlc_data_ready_mode_get(ism330dlc_ctx_t *ctx,
                                    ism330dlc_drdy_pulsed_t *val);

int32_t ism330dlc_device_id_get(ism330dlc_ctx_t *ctx, uint8_t *buff);
int32_t ism330dlc_reset_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_reset_get(ism330dlc_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DLC_LSB_AT_LOW_ADD  = 0,
  ISM330DLC_MSB_AT_LOW_ADD  = 1,
} ism330dlc_ble_t;
int32_t ism330dlc_data_format_set(ism330dlc_ctx_t *ctx, ism330dlc_ble_t val);
int32_t ism330dlc_data_format_get(ism330dlc_ctx_t *ctx, ism330dlc_ble_t *val);

int32_t ism330dlc_auto_increment_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_auto_increment_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_boot_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_boot_get(ism330dlc_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DLC_XL_ST_DISABLE    = 0,
  ISM330DLC_XL_ST_POSITIVE   = 1,
  ISM330DLC_XL_ST_NEGATIVE   = 2,
} ism330dlc_st_xl_t;
int32_t ism330dlc_xl_self_test_set(ism330dlc_ctx_t *ctx, ism330dlc_st_xl_t val);
int32_t ism330dlc_xl_self_test_get(ism330dlc_ctx_t *ctx, ism330dlc_st_xl_t *val);

typedef enum {
  ISM330DLC_GY_ST_DISABLE    = 0,
  ISM330DLC_GY_ST_POSITIVE   = 1,
  ISM330DLC_GY_ST_NEGATIVE   = 3,
} ism330dlc_st_g_t;
int32_t ism330dlc_gy_self_test_set(ism330dlc_ctx_t *ctx, ism330dlc_st_g_t val);
int32_t ism330dlc_gy_self_test_get(ism330dlc_ctx_t *ctx, ism330dlc_st_g_t *val);

int32_t ism330dlc_filter_settling_mask_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_filter_settling_mask_get(ism330dlc_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DLC_USE_SLOPE = 0,
  ISM330DLC_USE_HPF   = 1,
} ism330dlc_slope_fds_t;
int32_t ism330dlc_xl_hp_path_internal_set(ism330dlc_ctx_t *ctx,
                                        ism330dlc_slope_fds_t val);
int32_t ism330dlc_xl_hp_path_internal_get(ism330dlc_ctx_t *ctx,
                                        ism330dlc_slope_fds_t *val);

typedef enum {
  ISM330DLC_XL_ANA_BW_1k5Hz = 0,
  ISM330DLC_XL_ANA_BW_400Hz = 1,
} ism330dlc_bw0_xl_t;
int32_t ism330dlc_xl_filter_analog_set(ism330dlc_ctx_t *ctx,
                                     ism330dlc_bw0_xl_t val);
int32_t ism330dlc_xl_filter_analog_get(ism330dlc_ctx_t *ctx,
                                     ism330dlc_bw0_xl_t *val);

typedef enum {
  ISM330DLC_XL_LP1_ODR_DIV_2 = 0,
  ISM330DLC_XL_LP1_ODR_DIV_4 = 1,
  ISM330DLC_XL_LP1_NA        = 2,
} ism330dlc_lpf1_bw_sel_t;
int32_t ism330dlc_xl_lp1_bandwidth_set(ism330dlc_ctx_t *ctx,
                                     ism330dlc_lpf1_bw_sel_t val);
int32_t ism330dlc_xl_lp1_bandwidth_get(ism330dlc_ctx_t *ctx,
                                     ism330dlc_lpf1_bw_sel_t *val);

typedef enum {
  ISM330DLC_XL_LOW_LAT_LP_ODR_DIV_50     = 0x00,
  ISM330DLC_XL_LOW_LAT_LP_ODR_DIV_100    = 0x01,
  ISM330DLC_XL_LOW_LAT_LP_ODR_DIV_9      = 0x02,
  ISM330DLC_XL_LOW_LAT_LP_ODR_DIV_400    = 0x03,
  ISM330DLC_XL_LOW_NOISE_LP_ODR_DIV_50   = 0x10,
  ISM330DLC_XL_LOW_NOISE_LP_ODR_DIV_100  = 0x11,
  ISM330DLC_XL_LOW_NOISE_LP_ODR_DIV_9    = 0x12,
  ISM330DLC_XL_LOW_NOISE_LP_ODR_DIV_400  = 0x13,
  ISM330DLC_XL_LP_NA                     = 0x14
} ism330dlc_input_composite_t;
int32_t ism330dlc_xl_lp2_bandwidth_set(ism330dlc_ctx_t *ctx,
                                     ism330dlc_input_composite_t val);
int32_t ism330dlc_xl_lp2_bandwidth_get(ism330dlc_ctx_t *ctx,
                                     ism330dlc_input_composite_t *val);

int32_t ism330dlc_xl_reference_mode_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_xl_reference_mode_get(ism330dlc_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DLC_XL_HP_ODR_DIV_4      = 0x00, /* Slope filter */
  ISM330DLC_XL_HP_ODR_DIV_100    = 0x01,
  ISM330DLC_XL_HP_ODR_DIV_9      = 0x02,
  ISM330DLC_XL_HP_ODR_DIV_400    = 0x03,
  ISM330DLC_XL_HP_NA             = 0x04,
} ism330dlc_hpcf_xl_t;
int32_t ism330dlc_xl_hp_bandwidth_set(ism330dlc_ctx_t *ctx,
                                    ism330dlc_hpcf_xl_t val);
int32_t ism330dlc_xl_hp_bandwidth_get(ism330dlc_ctx_t *ctx,
                                    ism330dlc_hpcf_xl_t *val);

typedef enum {
  ISM330DLC_XL_UI_LP1_ODR_DIV_2 = 0,
  ISM330DLC_XL_UI_LP1_ODR_DIV_4 = 1,
  ISM330DLC_XL_UI_LP1_NA        = 2,  /* ERROR CODE */
} ism330dlc_ui_lpf1_bw_sel_t;
int32_t ism330dlc_xl_ui_lp1_bandwidth_set(ism330dlc_ctx_t *ctx,
                                        ism330dlc_ui_lpf1_bw_sel_t val);
int32_t ism330dlc_xl_ui_lp1_bandwidth_get(ism330dlc_ctx_t *ctx,
                                        ism330dlc_ui_lpf1_bw_sel_t *val);

int32_t ism330dlc_xl_ui_slope_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_xl_ui_slope_get(ism330dlc_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DLC_AUX_LP_LIGHT          = 2,
  ISM330DLC_AUX_LP_NORMAL         = 3,
  ISM330DLC_AUX_LP_STRONG         = 0,
  ISM330DLC_AUX_LP_AGGRESSIVE     = 1,
} ism330dlc_filter_xl_conf_ois_t;
int32_t ism330dlc_xl_aux_lp_bandwidth_set(ism330dlc_ctx_t *ctx,
                                        ism330dlc_filter_xl_conf_ois_t val);
int32_t ism330dlc_xl_aux_lp_bandwidth_get(ism330dlc_ctx_t *ctx,
                                        ism330dlc_filter_xl_conf_ois_t *val);

typedef enum {
  ISM330DLC_LP2_ONLY                    = 0x00,

  ISM330DLC_HP_16mHz_LP2                = 0x80,
  ISM330DLC_HP_65mHz_LP2                = 0x90,
  ISM330DLC_HP_260mHz_LP2               = 0xA0,
  ISM330DLC_HP_1Hz04_LP2                = 0xB0,

  ISM330DLC_HP_DISABLE_LP1_LIGHT        = 0x0A,
  ISM330DLC_HP_DISABLE_LP1_NORMAL       = 0x09,
  ISM330DLC_HP_DISABLE_LP_STRONG        = 0x08,
  ISM330DLC_HP_DISABLE_LP1_AGGRESSIVE   = 0x0B,

  ISM330DLC_HP_16mHz_LP1_LIGHT          = 0x8A,
  ISM330DLC_HP_65mHz_LP1_NORMAL         = 0x99,
  ISM330DLC_HP_260mHz_LP1_STRONG        = 0xA8,
  ISM330DLC_HP_1Hz04_LP1_AGGRESSIVE     = 0xBB,
} ism330dlc_lpf1_sel_g_t;
