stm32-hotspot/STM32C0316-DK-Brisk-Demo/B_OPTO_INERT/ism330dlc_reg.h
int32_t ism330dlc_gy_band_pass_set(ism330dlc_ctx_t *ctx,
                                    ism330dlc_lpf1_sel_g_t val);
int32_t ism330dlc_gy_band_pass_get(ism330dlc_ctx_t *ctx,
                                    ism330dlc_lpf1_sel_g_t *val);

int32_t ism330dlc_gy_ui_high_pass_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_gy_ui_high_pass_get(ism330dlc_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DLC_HP_DISABLE_LP_173Hz        = 0x02,
  ISM330DLC_HP_DISABLE_LP_237Hz        = 0x01,
  ISM330DLC_HP_DISABLE_LP_351Hz        = 0x00,
  ISM330DLC_HP_DISABLE_LP_937Hz        = 0x03,

  ISM330DLC_HP_16mHz_LP_173Hz          = 0x82,
  ISM330DLC_HP_65mHz_LP_237Hz          = 0x91,
  ISM330DLC_HP_260mHz_LP_351Hz         = 0xA0,
  ISM330DLC_HP_1Hz04_LP_937Hz          = 0xB3,
} ism330dlc_hp_en_ois_t;
int32_t ism330dlc_gy_aux_bandwidth_set(ism330dlc_ctx_t *ctx,
                                     ism330dlc_hp_en_ois_t val);
int32_t ism330dlc_gy_aux_bandwidth_get(ism330dlc_ctx_t *ctx,
                                     ism330dlc_hp_en_ois_t *val);

int32_t ism330dlc_aux_status_reg_get(ism330dlc_ctx_t *ctx,
                                   ism330dlc_status_spiaux_t *val);

int32_t ism330dlc_aux_xl_flag_data_ready_get(ism330dlc_ctx_t *ctx,
                                             uint8_t *val);

int32_t ism330dlc_aux_gy_flag_data_ready_get(ism330dlc_ctx_t *ctx,
                                             uint8_t *val);

int32_t ism330dlc_aux_gy_flag_settling_get(ism330dlc_ctx_t *ctx,
                                           uint8_t *val);

typedef enum {
  ISM330DLC_AUX_DEN_DISABLE         = 0,
  ISM330DLC_AUX_DEN_LEVEL_LATCH     = 3,
  ISM330DLC_AUX_DEN_LEVEL_TRIG      = 2,
} ism330dlc_lvl_ois_t;
int32_t ism330dlc_aux_den_mode_set(ism330dlc_ctx_t *ctx,
                                 ism330dlc_lvl_ois_t val);
int32_t ism330dlc_aux_den_mode_get(ism330dlc_ctx_t *ctx,
                                 ism330dlc_lvl_ois_t *val);

int32_t ism330dlc_aux_drdy_on_int2_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_aux_drdy_on_int2_get(ism330dlc_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DLC_AUX_DISABLE   = 0,
  ISM330DLC_MODE_3_GY     = 1,
  ISM330DLC_MODE_4_GY_XL  = 3,
} ism330dlc_ois_en_spi2_t;
int32_t ism330dlc_aux_mode_set(ism330dlc_ctx_t *ctx,
                               ism330dlc_ois_en_spi2_t val);
int32_t ism330dlc_aux_mode_get(ism330dlc_ctx_t *ctx,
                               ism330dlc_ois_en_spi2_t *val);

typedef enum {
  ISM330DLC_250dps_AUX   = 0,
  ISM330DLC_125dps_AUX   = 1,
  ISM330DLC_500dps_AUX   = 2,
  ISM330DLC_1000dps_AUX  = 4,
  ISM330DLC_2000dps_AUX  = 6,
} ism330dlc_fs_g_ois_t;
int32_t ism330dlc_aux_gy_full_scale_set(ism330dlc_ctx_t *ctx,
                                      ism330dlc_fs_g_ois_t val);
int32_t ism330dlc_aux_gy_full_scale_get(ism330dlc_ctx_t *ctx,
                                      ism330dlc_fs_g_ois_t *val);

typedef enum {
  ISM330DLC_AUX_SPI_4_WIRE = 0,
  ISM330DLC_AUX_SPI_3_WIRE = 1,
} ism330dlc_sim_ois_t;
int32_t ism330dlc_aux_spi_mode_set(ism330dlc_ctx_t *ctx,
                                   ism330dlc_sim_ois_t val);
int32_t ism330dlc_aux_spi_mode_get(ism330dlc_ctx_t *ctx,
                                   ism330dlc_sim_ois_t *val);

typedef enum {
  ISM330DLC_AUX_LSB_AT_LOW_ADD = 0,
  ISM330DLC_AUX_MSB_AT_LOW_ADD = 1,
} ism330dlc_ble_ois_t;
int32_t ism330dlc_aux_data_format_set(ism330dlc_ctx_t *ctx,
                                    ism330dlc_ble_ois_t val);
int32_t ism330dlc_aux_data_format_get(ism330dlc_ctx_t *ctx,
                                    ism330dlc_ble_ois_t *val);

typedef enum {
  ISM330DLC_ENABLE_CLAMP    = 0,
  ISM330DLC_DISABLE_CLAMP   = 1,
} ism330dlc_st_ois_clampdis_t;
int32_t ism330dlc_aux_gy_clamp_set(ism330dlc_ctx_t *ctx,
                                 ism330dlc_st_ois_clampdis_t val);
int32_t ism330dlc_aux_gy_clamp_get(ism330dlc_ctx_t *ctx,
                                 ism330dlc_st_ois_clampdis_t *val);

typedef enum {
  ISM330DLC_AUX_GY_DISABLE  = 0,
  ISM330DLC_AUX_GY_POS      = 1,
  ISM330DLC_AUX_GY_NEG      = 3,
} ism330dlc_st_ois_t;
int32_t ism330dlc_aux_gy_self_test_set(ism330dlc_ctx_t *ctx,
                                     ism330dlc_st_ois_t val);
int32_t ism330dlc_aux_gy_self_test_get(ism330dlc_ctx_t *ctx,
                                     ism330dlc_st_ois_t *val);

typedef enum {
  ISM330DLC_AUX_2g   = 0,
  ISM330DLC_AUX_16g  = 1,
  ISM330DLC_AUX_4g   = 2,
  ISM330DLC_AUX_8g   = 3,
} ism330dlc_fs_xl_ois_t;
int32_t ism330dlc_aux_xl_full_scale_set(ism330dlc_ctx_t *ctx,
                                      ism330dlc_fs_xl_ois_t val);
int32_t ism330dlc_aux_xl_full_scale_get(ism330dlc_ctx_t *ctx,
                                      ism330dlc_fs_xl_ois_t *val);

typedef enum {
  ISM330DLC_AUX_DEN_ACTIVE_LOW   = 0,
  ISM330DLC_AUX_DEN_ACTIVE_HIGH  = 1,
} ism330dlc_den_lh_ois_t;
int32_t ism330dlc_aux_den_polarity_set(ism330dlc_ctx_t *ctx,
                                     ism330dlc_den_lh_ois_t val);
int32_t ism330dlc_aux_den_polarity_get(ism330dlc_ctx_t *ctx,
                                     ism330dlc_den_lh_ois_t *val);

typedef enum {
  ISM330DLC_SPI_4_WIRE  = 0,
  ISM330DLC_SPI_3_WIRE  = 1,
} ism330dlc_sim_t;
int32_t ism330dlc_spi_mode_set(ism330dlc_ctx_t *ctx, ism330dlc_sim_t val);
int32_t ism330dlc_spi_mode_get(ism330dlc_ctx_t *ctx, ism330dlc_sim_t *val);

typedef enum {
  ISM330DLC_I2C_ENABLE   = 0,
  ISM330DLC_I2C_DISABLE  = 1,
} ism330dlc_i2c_disable_t;
int32_t ism330dlc_i2c_interface_set(ism330dlc_ctx_t *ctx,
                                  ism330dlc_i2c_disable_t val);
int32_t ism330dlc_i2c_interface_get(ism330dlc_ctx_t *ctx,
                                  ism330dlc_i2c_disable_t *val);

typedef struct {
  uint8_t int1_drdy_xl             : 1;
  uint8_t int1_drdy_g              : 1;
  uint8_t int1_boot                : 1;
  uint8_t int1_fth                 : 1;
  uint8_t int1_fifo_ovr            : 1;
  uint8_t int1_full_flag           : 1;
  uint8_t int1_tilt                : 1;
  uint8_t int1_6d                  : 1;
  uint8_t int1_double_tap          : 1;
  uint8_t int1_ff                  : 1;
  uint8_t int1_wu                  : 1;
  uint8_t int1_single_tap          : 1;
  uint8_t int1_inact_state         : 1;
  uint8_t den_drdy_int1            : 1;
  uint8_t drdy_on_int1             : 1;
} ism330dlc_int1_route_t;
