stm32-hotspot/STM32C0316-DK-Brisk-Demo/B_OPTO_INERT/ism330dlc_reg.h
int32_t ism330dlc_pin_int1_route_set(ism330dlc_ctx_t *ctx,
                                   ism330dlc_int1_route_t val);
int32_t ism330dlc_pin_int1_route_get(ism330dlc_ctx_t *ctx,
                                   ism330dlc_int1_route_t *val);

typedef struct{
  uint8_t int2_drdy_xl             : 1;
  uint8_t int2_drdy_g              : 1;
  uint8_t int2_drdy_temp           : 1;
  uint8_t int2_fth                 : 1;
  uint8_t int2_fifo_ovr            : 1;
  uint8_t int2_full_flag           : 1;
  uint8_t int2_iron                : 1;
  uint8_t int2_tilt                : 1;
  uint8_t int2_6d                  : 1;
  uint8_t int2_double_tap          : 1;
  uint8_t int2_ff                  : 1;
  uint8_t int2_wu                  : 1;
  uint8_t int2_single_tap          : 1;
  uint8_t int2_inact_state         : 1;
} ism330dlc_int2_route_t;
int32_t ism330dlc_pin_int2_route_set(ism330dlc_ctx_t *ctx,
                                   ism330dlc_int2_route_t val);
int32_t ism330dlc_pin_int2_route_get(ism330dlc_ctx_t *ctx,
                                   ism330dlc_int2_route_t *val);

typedef enum {
  ISM330DLC_PUSH_PULL   = 0,
  ISM330DLC_OPEN_DRAIN  = 1,
} ism330dlc_pp_od_t;
int32_t ism330dlc_pin_mode_set(ism330dlc_ctx_t *ctx, ism330dlc_pp_od_t val);
int32_t ism330dlc_pin_mode_get(ism330dlc_ctx_t *ctx, ism330dlc_pp_od_t *val);

typedef enum {
  ISM330DLC_ACTIVE_HIGH   = 0,
  ISM330DLC_ACTIVE_LOW    = 1,
} ism330dlc_h_lactive_t;
int32_t ism330dlc_pin_polarity_set(ism330dlc_ctx_t *ctx, ism330dlc_h_lactive_t val);
int32_t ism330dlc_pin_polarity_get(ism330dlc_ctx_t *ctx, ism330dlc_h_lactive_t *val);

int32_t ism330dlc_all_on_int1_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_all_on_int1_get(ism330dlc_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DLC_INT_PULSED   = 0,
  ISM330DLC_INT_LATCHED  = 1,
} ism330dlc_lir_t;
int32_t ism330dlc_int_notification_set(ism330dlc_ctx_t *ctx, ism330dlc_lir_t val);
int32_t ism330dlc_int_notification_get(ism330dlc_ctx_t *ctx, ism330dlc_lir_t *val);

int32_t ism330dlc_wkup_threshold_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_wkup_threshold_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_wkup_dur_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_wkup_dur_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_gy_sleep_mode_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_gy_sleep_mode_get(ism330dlc_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DLC_PROPERTY_DISABLE          = 0,
  ISM330DLC_XL_12Hz5_GY_NOT_AFFECTED  = 1,
  ISM330DLC_XL_12Hz5_GY_SLEEP         = 2,
  ISM330DLC_XL_12Hz5_GY_PD            = 3,
} ism330dlc_inact_en_t;
int32_t ism330dlc_act_mode_set(ism330dlc_ctx_t *ctx, ism330dlc_inact_en_t val);
int32_t ism330dlc_act_mode_get(ism330dlc_ctx_t *ctx, ism330dlc_inact_en_t *val);

int32_t ism330dlc_act_sleep_dur_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_act_sleep_dur_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_tap_src_get(ism330dlc_ctx_t *ctx, ism330dlc_tap_src_t *val);

int32_t ism330dlc_tap_detection_on_z_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_tap_detection_on_z_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_tap_detection_on_y_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_tap_detection_on_y_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_tap_detection_on_x_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_tap_detection_on_x_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_tap_threshold_x_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_tap_threshold_x_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_tap_shock_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_tap_shock_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_tap_quiet_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_tap_quiet_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_tap_dur_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_tap_dur_get(ism330dlc_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DLC_ONLY_SINGLE          = 0,
  ISM330DLC_BOTH_SINGLE_DOUBLE   = 1,
} ism330dlc_single_double_tap_t;
int32_t ism330dlc_tap_mode_set(ism330dlc_ctx_t *ctx,
                             ism330dlc_single_double_tap_t val);
int32_t ism330dlc_tap_mode_get(ism330dlc_ctx_t *ctx,
                             ism330dlc_single_double_tap_t *val);

typedef enum {
  ISM330DLC_ODR_DIV_2_FEED      = 0,
  ISM330DLC_LPF2_FEED           = 1,
} ism330dlc_low_pass_on_6d_t;
int32_t ism330dlc_6d_feed_data_set(ism330dlc_ctx_t *ctx,
                                 ism330dlc_low_pass_on_6d_t val);
int32_t ism330dlc_6d_feed_data_get(ism330dlc_ctx_t *ctx,
                                 ism330dlc_low_pass_on_6d_t *val);

typedef enum {
  ISM330DLC_DEG_80      = 0,
  ISM330DLC_DEG_70      = 1,
  ISM330DLC_DEG_60      = 2,
  ISM330DLC_DEG_50      = 3,
} ism330dlc_sixd_ths_t;
int32_t ism330dlc_6d_threshold_set(ism330dlc_ctx_t *ctx, ism330dlc_sixd_ths_t val);
int32_t ism330dlc_6d_threshold_get(ism330dlc_ctx_t *ctx, ism330dlc_sixd_ths_t *val);

int32_t ism330dlc_4d_mode_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_4d_mode_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_ff_dur_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_ff_dur_get(ism330dlc_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DLC_FF_TSH_156mg = 0,
  ISM330DLC_FF_TSH_219mg = 1,
  ISM330DLC_FF_TSH_250mg = 2,
  ISM330DLC_FF_TSH_312mg = 3,
  ISM330DLC_FF_TSH_344mg = 4,
  ISM330DLC_FF_TSH_406mg = 5,
  ISM330DLC_FF_TSH_469mg = 6,
  ISM330DLC_FF_TSH_500mg = 7,
} ism330dlc_ff_ths_t;
int32_t ism330dlc_ff_threshold_set(ism330dlc_ctx_t *ctx, ism330dlc_ff_ths_t val);
int32_t ism330dlc_ff_threshold_get(ism330dlc_ctx_t *ctx, ism330dlc_ff_ths_t *val);

int32_t ism330dlc_fifo_watermark_set(ism330dlc_ctx_t *ctx, uint16_t val);
int32_t ism330dlc_fifo_watermark_get(ism330dlc_ctx_t *ctx, uint16_t *val);

