stm32-hotspot/STM32C0316-DK-Brisk-Demo/B_OPTO_INERT/ism330dlc_reg.h
int32_t ism330dlc_fifo_data_level_get(ism330dlc_ctx_t *ctx, uint16_t *val);

int32_t ism330dlc_fifo_wtm_flag_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_fifo_pattern_get(ism330dlc_ctx_t *ctx, uint16_t *val);

int32_t ism330dlc_fifo_temp_batch_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_fifo_temp_batch_get(ism330dlc_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DLC_TRG_XL_GY_DRDY     = 0,
  ISM330DLC_TRG_SH_DRDY        = 1,
} ism330dlc_trigger_fifo_t;
int32_t ism330dlc_fifo_write_trigger_set(ism330dlc_ctx_t *ctx,
                                       ism330dlc_trigger_fifo_t val);
int32_t ism330dlc_fifo_write_trigger_get(ism330dlc_ctx_t *ctx,
                                       ism330dlc_trigger_fifo_t *val);

typedef enum {
  ISM330DLC_FIFO_XL_DISABLE  = 0,
  ISM330DLC_FIFO_XL_NO_DEC   = 1,
  ISM330DLC_FIFO_XL_DEC_2    = 2,
  ISM330DLC_FIFO_XL_DEC_3    = 3,
  ISM330DLC_FIFO_XL_DEC_4    = 4,
  ISM330DLC_FIFO_XL_DEC_8    = 5,
  ISM330DLC_FIFO_XL_DEC_16   = 6,
  ISM330DLC_FIFO_XL_DEC_32   = 7,
} ism330dlc_dec_fifo_xl_t;
int32_t ism330dlc_fifo_xl_batch_set(ism330dlc_ctx_t *ctx,
                                  ism330dlc_dec_fifo_xl_t val);
int32_t ism330dlc_fifo_xl_batch_get(ism330dlc_ctx_t *ctx,
                                  ism330dlc_dec_fifo_xl_t *val);

typedef enum {
  ISM330DLC_FIFO_GY_DISABLE = 0,
  ISM330DLC_FIFO_GY_NO_DEC  = 1,
  ISM330DLC_FIFO_GY_DEC_2   = 2,
  ISM330DLC_FIFO_GY_DEC_3   = 3,
  ISM330DLC_FIFO_GY_DEC_4   = 4,
  ISM330DLC_FIFO_GY_DEC_8   = 5,
  ISM330DLC_FIFO_GY_DEC_16  = 6,
  ISM330DLC_FIFO_GY_DEC_32  = 7,
} ism330dlc_dec_fifo_gyro_t;
int32_t ism330dlc_fifo_gy_batch_set(ism330dlc_ctx_t *ctx,
                                  ism330dlc_dec_fifo_gyro_t val);
int32_t ism330dlc_fifo_gy_batch_get(ism330dlc_ctx_t *ctx,
                                  ism330dlc_dec_fifo_gyro_t *val);

typedef enum {
  ISM330DLC_FIFO_DS3_DISABLE   = 0,
  ISM330DLC_FIFO_DS3_NO_DEC    = 1,
  ISM330DLC_FIFO_DS3_DEC_2     = 2,
  ISM330DLC_FIFO_DS3_DEC_3     = 3,
  ISM330DLC_FIFO_DS3_DEC_4     = 4,
  ISM330DLC_FIFO_DS3_DEC_8     = 5,
  ISM330DLC_FIFO_DS3_DEC_16    = 6,
  ISM330DLC_FIFO_DS3_DEC_32    = 7,
} ism330dlc_dec_ds3_fifo_t;
int32_t ism330dlc_fifo_dataset_3_batch_set(ism330dlc_ctx_t *ctx,
                                         ism330dlc_dec_ds3_fifo_t val);
int32_t ism330dlc_fifo_dataset_3_batch_get(ism330dlc_ctx_t *ctx,
                                         ism330dlc_dec_ds3_fifo_t *val);

typedef enum {
  ISM330DLC_FIFO_DS4_DISABLE  = 0,
  ISM330DLC_FIFO_DS4_NO_DEC   = 1,
  ISM330DLC_FIFO_DS4_DEC_2    = 2,
  ISM330DLC_FIFO_DS4_DEC_3    = 3,
  ISM330DLC_FIFO_DS4_DEC_4    = 4,
  ISM330DLC_FIFO_DS4_DEC_8    = 5,
  ISM330DLC_FIFO_DS4_DEC_16   = 6,
  ISM330DLC_FIFO_DS4_DEC_32   = 7,
} ism330dlc_dec_ds4_fifo_t;
int32_t ism330dlc_fifo_dataset_4_batch_set(ism330dlc_ctx_t *ctx,
                                         ism330dlc_dec_ds4_fifo_t val);
int32_t ism330dlc_fifo_dataset_4_batch_get(ism330dlc_ctx_t *ctx,
                                         ism330dlc_dec_ds4_fifo_t *val);

int32_t ism330dlc_fifo_xl_gy_8bit_format_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_fifo_xl_gy_8bit_format_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_fifo_stop_on_wtm_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_fifo_stop_on_wtm_get(ism330dlc_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DLC_BYPASS_MODE           = 0,
  ISM330DLC_FIFO_MODE             = 1,
  ISM330DLC_STREAM_TO_FIFO_MODE   = 3,
  ISM330DLC_BYPASS_TO_STREAM_MODE = 4,
  ISM330DLC_STREAM_MODE           = 6,
} ism330dlc_fifo_mode_t;
int32_t ism330dlc_fifo_mode_set(ism330dlc_ctx_t *ctx, ism330dlc_fifo_mode_t val);
int32_t ism330dlc_fifo_mode_get(ism330dlc_ctx_t *ctx, ism330dlc_fifo_mode_t *val);

typedef enum {
  ISM330DLC_FIFO_DISABLE   =  0,
  ISM330DLC_FIFO_12Hz5     =  1,
  ISM330DLC_FIFO_26Hz      =  2,
  ISM330DLC_FIFO_52Hz      =  3,
  ISM330DLC_FIFO_104Hz     =  4,
  ISM330DLC_FIFO_208Hz     =  5,
  ISM330DLC_FIFO_416Hz     =  6,
  ISM330DLC_FIFO_833Hz     =  7,
  ISM330DLC_FIFO_1k66Hz    =  8,
  ISM330DLC_FIFO_3k33Hz    =  9,
  ISM330DLC_FIFO_6k66Hz    = 10,
} ism330dlc_odr_fifo_t;
int32_t ism330dlc_fifo_data_rate_set(ism330dlc_ctx_t *ctx,
                                   ism330dlc_odr_fifo_t val);
int32_t ism330dlc_fifo_data_rate_get(ism330dlc_ctx_t *ctx,
                                   ism330dlc_odr_fifo_t *val);

typedef enum {
  ISM330DLC_DEN_ACT_LOW    = 0,
  ISM330DLC_DEN_ACT_HIGH   = 1,
} ism330dlc_den_lh_t;
int32_t ism330dlc_den_polarity_set(ism330dlc_ctx_t *ctx, ism330dlc_den_lh_t val);
int32_t ism330dlc_den_polarity_get(ism330dlc_ctx_t *ctx, ism330dlc_den_lh_t *val);

typedef enum {
  ISM330DLC_DEN_DISABLE    = 0,
  ISM330DLC_LEVEL_FIFO     = 6,
  ISM330DLC_LEVEL_LETCHED  = 3,
  ISM330DLC_LEVEL_TRIGGER  = 2,
  ISM330DLC_EDGE_TRIGGER   = 4,
} ism330dlc_den_mode_t;
int32_t ism330dlc_den_mode_set(ism330dlc_ctx_t *ctx, ism330dlc_den_mode_t val);
int32_t ism330dlc_den_mode_get(ism330dlc_ctx_t *ctx, ism330dlc_den_mode_t *val);

typedef enum {
  ISM330DLC_STAMP_IN_GY_DATA     = 0,
  ISM330DLC_STAMP_IN_XL_DATA     = 1,
  ISM330DLC_STAMP_IN_GY_XL_DATA  = 2,
} ism330dlc_den_xl_en_t;
int32_t ism330dlc_den_enable_set(ism330dlc_ctx_t *ctx, ism330dlc_den_xl_en_t val);
int32_t ism330dlc_den_enable_get(ism330dlc_ctx_t *ctx, ism330dlc_den_xl_en_t *val);

int32_t ism330dlc_den_mark_axis_z_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_den_mark_axis_z_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_den_mark_axis_y_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_den_mark_axis_y_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_den_mark_axis_x_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_den_mark_axis_x_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_tilt_sens_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_tilt_sens_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_wrist_tilt_sens_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_wrist_tilt_sens_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_tilt_latency_set(ism330dlc_ctx_t *ctx, uint8_t *buff);
int32_t ism330dlc_tilt_latency_get(ism330dlc_ctx_t *ctx, uint8_t *buff);

