stm32-hotspot/STM32C0316-DK-Brisk-Demo/B_OPTO_INERT/ism330dlc_reg.h
int32_t ism330dlc_tilt_threshold_set(ism330dlc_ctx_t *ctx, uint8_t *buff);
int32_t ism330dlc_tilt_threshold_get(ism330dlc_ctx_t *ctx, uint8_t *buff);

int32_t ism330dlc_mag_soft_iron_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_mag_soft_iron_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_mag_hard_iron_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_mag_hard_iron_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_mag_soft_iron_mat_set(ism330dlc_ctx_t *ctx, uint8_t *buff);
int32_t ism330dlc_mag_soft_iron_mat_get(ism330dlc_ctx_t *ctx, uint8_t *buff);

int32_t ism330dlc_mag_offset_set(ism330dlc_ctx_t *ctx, uint8_t *buff);
int32_t ism330dlc_mag_offset_get(ism330dlc_ctx_t *ctx, uint8_t *buff);

int32_t ism330dlc_sh_sync_sens_frame_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_sh_sync_sens_frame_get(ism330dlc_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DLC_RES_RATIO_2_11  = 0,
  ISM330DLC_RES_RATIO_2_12  = 1,
  ISM330DLC_RES_RATIO_2_13  = 2,
  ISM330DLC_RES_RATIO_2_14  = 3,
} ism330dlc_rr_t;
int32_t ism330dlc_sh_sync_sens_ratio_set(ism330dlc_ctx_t *ctx, ism330dlc_rr_t val);
int32_t ism330dlc_sh_sync_sens_ratio_get(ism330dlc_ctx_t *ctx, ism330dlc_rr_t *val);

int32_t ism330dlc_sh_master_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_sh_master_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_sh_pass_through_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_sh_pass_through_get(ism330dlc_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DLC_EXT_PULL_UP       = 0,
  ISM330DLC_INTERNAL_PULL_UP  = 1,
} ism330dlc_pull_up_en_t;
int32_t ism330dlc_sh_pin_mode_set(ism330dlc_ctx_t *ctx, ism330dlc_pull_up_en_t val);
int32_t ism330dlc_sh_pin_mode_get(ism330dlc_ctx_t *ctx, ism330dlc_pull_up_en_t *val);

typedef enum {
  ISM330DLC_XL_GY_DRDY        = 0,
  ISM330DLC_EXT_ON_INT2_PIN   = 1,
} ism330dlc_start_config_t;
int32_t ism330dlc_sh_syncro_mode_set(ism330dlc_ctx_t *ctx,
                                   ism330dlc_start_config_t val);
int32_t ism330dlc_sh_syncro_mode_get(ism330dlc_ctx_t *ctx,
                                   ism330dlc_start_config_t *val);

int32_t ism330dlc_sh_drdy_on_int1_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_sh_drdy_on_int1_get(ism330dlc_ctx_t *ctx, uint8_t *val);

typedef struct {
    ism330dlc_sensorhub1_reg_t   sh_byte_1;
    ism330dlc_sensorhub2_reg_t   sh_byte_2;
    ism330dlc_sensorhub3_reg_t   sh_byte_3;
    ism330dlc_sensorhub4_reg_t   sh_byte_4;
    ism330dlc_sensorhub5_reg_t   sh_byte_5;
    ism330dlc_sensorhub6_reg_t   sh_byte_6;
    ism330dlc_sensorhub7_reg_t   sh_byte_7;
    ism330dlc_sensorhub8_reg_t   sh_byte_8;
    ism330dlc_sensorhub9_reg_t   sh_byte_9;
    ism330dlc_sensorhub10_reg_t  sh_byte_10;
    ism330dlc_sensorhub11_reg_t  sh_byte_11;
    ism330dlc_sensorhub12_reg_t  sh_byte_12;
    ism330dlc_sensorhub13_reg_t  sh_byte_13;
    ism330dlc_sensorhub14_reg_t  sh_byte_14;
    ism330dlc_sensorhub15_reg_t  sh_byte_15;
    ism330dlc_sensorhub16_reg_t  sh_byte_16;
    ism330dlc_sensorhub17_reg_t  sh_byte_17;
    ism330dlc_sensorhub18_reg_t  sh_byte_18;
} ism330dlc_emb_sh_read_t;
int32_t ism330dlc_sh_read_data_raw_get(ism330dlc_ctx_t *ctx,
                                     ism330dlc_emb_sh_read_t *val);

int32_t ism330dlc_sh_cmd_sens_sync_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_sh_cmd_sens_sync_get(ism330dlc_ctx_t *ctx, uint8_t *val);

int32_t ism330dlc_sh_spi_sync_error_set(ism330dlc_ctx_t *ctx, uint8_t val);
int32_t ism330dlc_sh_spi_sync_error_get(ism330dlc_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DLC_NORMAL_MODE_READ  = 0,
  ISM330DLC_SRC_MODE_READ     = 1,
} ism330dlc_src_mode_t;
int32_t ism330dlc_sh_cfg_slave_0_rd_mode_set(ism330dlc_ctx_t *ctx,
                                           ism330dlc_src_mode_t val);
int32_t ism330dlc_sh_cfg_slave_0_rd_mode_get(ism330dlc_ctx_t *ctx,
                                           ism330dlc_src_mode_t *val);

typedef enum {
  ISM330DLC_SLV_0        = 0,
  ISM330DLC_SLV_0_1      = 1,
  ISM330DLC_SLV_0_1_2    = 2,
  ISM330DLC_SLV_0_1_2_3  = 3,
} ism330dlc_aux_sens_on_t;
int32_t ism330dlc_sh_num_of_dev_connected_set(ism330dlc_ctx_t *ctx,
                                            ism330dlc_aux_sens_on_t val);
int32_t ism330dlc_sh_num_of_dev_connected_get(ism330dlc_ctx_t *ctx,
                                            ism330dlc_aux_sens_on_t *val);

typedef struct{
  uint8_t   slv0_add;
  uint8_t   slv0_subadd;
  uint8_t   slv0_data;
} ism330dlc_sh_cfg_write_t;
int32_t ism330dlc_sh_cfg_write(ism330dlc_ctx_t *ctx, ism330dlc_sh_cfg_write_t *val);

typedef struct{
  uint8_t   slv_add;
  uint8_t   slv_subadd;
  uint8_t   slv_len;
} ism330dlc_sh_cfg_read_t;
int32_t ism330dlc_sh_slv0_cfg_read(ism330dlc_ctx_t *ctx,
                                 ism330dlc_sh_cfg_read_t *val);
int32_t ism330dlc_sh_slv1_cfg_read(ism330dlc_ctx_t *ctx,
                                 ism330dlc_sh_cfg_read_t *val);
int32_t ism330dlc_sh_slv2_cfg_read(ism330dlc_ctx_t *ctx,
                                 ism330dlc_sh_cfg_read_t *val);
int32_t ism330dlc_sh_slv3_cfg_read(ism330dlc_ctx_t *ctx,
                                 ism330dlc_sh_cfg_read_t *val);

typedef enum {
  ISM330DLC_SL0_NO_DEC   = 0,
  ISM330DLC_SL0_DEC_2    = 1,
  ISM330DLC_SL0_DEC_4    = 2,
  ISM330DLC_SL0_DEC_8    = 3,
} ism330dlc_slave0_rate_t;
int32_t ism330dlc_sh_slave_0_dec_set(ism330dlc_ctx_t *ctx,
                                   ism330dlc_slave0_rate_t val);
int32_t ism330dlc_sh_slave_0_dec_get(ism330dlc_ctx_t *ctx,
                                   ism330dlc_slave0_rate_t *val);

typedef enum {
  ISM330DLC_EACH_SH_CYCLE     = 0,
  ISM330DLC_ONLY_FIRST_CYCLE  = 1,
} ism330dlc_write_once_t;
int32_t ism330dlc_sh_write_mode_set(ism330dlc_ctx_t *ctx,
                                  ism330dlc_write_once_t val);
int32_t ism330dlc_sh_write_mode_get(ism330dlc_ctx_t *ctx,
                                  ism330dlc_write_once_t *val);

typedef enum {
  ISM330DLC_SL1_NO_DEC   = 0,
  ISM330DLC_SL1_DEC_2    = 1,
  ISM330DLC_SL1_DEC_4    = 2,
  ISM330DLC_SL1_DEC_8    = 3,
} ism330dlc_slave1_rate_t;
int32_t ism330dlc_sh_slave_1_dec_set(ism330dlc_ctx_t *ctx,
                                   ism330dlc_slave1_rate_t val);
int32_t ism330dlc_sh_slave_1_dec_get(ism330dlc_ctx_t *ctx,
                                   ism330dlc_slave1_rate_t *val);

typedef enum {
  ISM330DLC_SL2_NO_DEC  = 0,
  ISM330DLC_SL2_DEC_2   = 1,
  ISM330DLC_SL2_DEC_4   = 2,
  ISM330DLC_SL2_DEC_8   = 3,
} ism330dlc_slave2_rate_t;
int32_t ism330dlc_sh_slave_2_dec_set(ism330dlc_ctx_t *ctx,
                                   ism330dlc_slave2_rate_t val);
int32_t ism330dlc_sh_slave_2_dec_get(ism330dlc_ctx_t *ctx,
                                   ism330dlc_slave2_rate_t *val);

typedef enum {
  ISM330DLC_SL3_NO_DEC  = 0,
  ISM330DLC_SL3_DEC_2   = 1,
  ISM330DLC_SL3_DEC_4   = 2,
  ISM330DLC_SL3_DEC_8   = 3,
} ism330dlc_slave3_rate_t;
int32_t ism330dlc_sh_slave_3_dec_set(ism330dlc_ctx_t *ctx,
                                   ism330dlc_slave3_rate_t val);
int32_t ism330dlc_sh_slave_3_dec_get(ism330dlc_ctx_t *ctx,
                                   ism330dlc_slave3_rate_t *val);

/**
  * @}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* ISM330DLC_DRIVER_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/